---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ShowIconParam
source: html/b30d8c32-5a2f-f7d4-5c7f-81ebe491231d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ShowIconParam Property

"Flag to display icon in Ribbon Combo Item"

## Syntax (C#)
```csharp
public static ForgeTypeId ShowIconParam { get; }
```